stress-test/get-reviews.yml
config:
  target: "http://127.0.0.1:3003"
  processor: "./testFuncs.js"
  phases:
    - duration: 10
      arrivalRate: 1
      name: Warm up
    - duration: 20
      arrivalRate: 10
      name: increase to 10RPS
    - duration: 30
      arrivalRate: 100
      name: increase to 100RPS
    - duration: 10
      arrivalRate: 1000
      name: increase to 1000RPS
scenarios:
  - name: "Get reviews"
    flow:
      - function: randomId
      - get:
          url: "/api/individual_reviews/{{ id }}"
      - get:
          url: "/api/overall_reviews/{{ id }}"